app/controllers/adminmain_controller.rb

SELECT * FROM `promoanks` WHERE (`promoanks`.`moderate` = 0 AND `promoanks`.`checkemail` = 1 AND `promoanks`.`reject` = 0)
SELECT * FROM `firms` WHERE (`firms`.`moderate` = 0 AND `firms`.`checkemail` = 1)
---
  def index
    @page=params[:page]
    if @page == nil
      @page='0'
    end
    @nanks=Promoank.find_all_by_moderate_and_checkemail_and_reject(false,true,false)
    @anks=Promoank.find(:all)
    @nfirms=Firm.find_all_by_moderate_and_checkemail(false,true)