app/controllers/adminlogin_controller.rb

  def index
  session[:group]="admin"
  session[:user_id]=nil
     if request.post?
      user = check
      if user
         session[:user_id] = user.kod
         session[:pass] = user.pass
         session[:notice]= "Здравствуйте, Администратор."
         @loger=Loger.new
         @loger.objid=user.id
         @loger.objtype="admin"
         @loger.accin=true
         @loger.save
---
INSERT INTO `logers` (`created_at`, `updated_at`, `objid`, `objtype`, `accin`) VALUES('2010-04-26 13:04:19', '2010-04-26 13:04:19', 1, 'admin', 1)