app/controllers/promomain_controller.rb

  def index
    @page=params[:page]
    if @page == nil
      @page='0'
    end
  @ank=Promoank.find_by_email(session[:user_id])
  @anktogroups=Anktogroup.find_all_by_promoank_id(@ank.id)
  @anktolangs=Anktolang.find_all_by_promoank_id(@ank.id)
  @selanks=Selank.find_all_by_promoank_id_and_payed(@ank.id,false)
---
SELECT * FROM `promoanks` WHERE (`promoanks`.`email` = 'alexey@itima.ru') LIMIT 1
SELECT * FROM `anktogroups` WHERE (`anktogroups`.`promoank_id` = 1)
SELECT * FROM `anktolangs` WHERE (`anktolangs`.`promoank_id` = 1)
SELECT * FROM `selanks` WHERE (`selanks`.`promoank_id` = 1 AND `selanks`.`payed` = 0)