app/controllers/promologin_controller.rb

  def index
  session[:group]='promo'
  session[:user_id]=nil
     if request.post?
      user = check
      if user
         session[:user_id] = user.email
         session[:pass] = params[:pass]
         session[:notice]= "Здравствуйте, ",user.fname, "."
         @loger=Loger.new
         @loger.objid=user.id
         @loger.objtype="promo"
         @loger.accin=true
         @loger.save
---
INSERT INTO `logers` (`created_at`, `updated_at`, `objid`, `objtype`, `accin`) VALUES('2010-04-26 13:04:33', '2010-04-26 13:04:33', 1, 'promo', 1)