app/controllers/promoanks_controller.rb

  def moderateank
    setwsadmin
    checkauth
    @ank=Promoank.find(params[:id])
    if params[:ok] == '1'
      @ank.moderate=true
    else
      @ank.rejectmsg=params[:rejectmsg]
      @ank.reject=true
    end

    @ank.save
---
SELECT * FROM `promoanks` WHERE (`promoanks`.`id` = 1)
UPDATE `promoanks` SET `updated_at` = '2010-04-26 14:19:22', `reject` = 1, `rejectmsg` = 'флыовралдофырадлофырва' WHERE `id` = 2

  def sendtoank
    setwspromo
    checkid(params[:id].to_i)

    @ank=Promoank.find(params[:id])
---
SELECT * FROM `promoanks` WHERE (`promoanks`.`id` = 1)

  def avtoactive

    @ank=Promoank.find_by_email_and_pass(params[:email].to_s.downcase,params[:pass])
    if @ank != nil
      @hash=Base64.decode64(params[:hash].to_s+"==")
      if @hash==(@ank.updated_at.to_s+@ank.created_at.to_s)

        @ank.checkemail=true
        @ank.save
        session[:user_id]=@ank.email
        session[:group]= "promo"
        session[:pass] = @ank.pass
        @loger=Loger.new
        @loger.objid=@ank.id
        @loger.objtype="promo"
        @loger.accin=true
        @loger.save
---
SELECT * FROM `promoanks` WHERE (`promoanks`.`email` = 'alexey@itima.ru' AND `promoanks`.`pass` = 'qweqwe') LIMIT 1
UPDATE `promoanks` SET `updated_at` = '2010-04-26 13:03:09', `checkemail` = 1 WHERE `id` = 1
INSERT INTO `logers` (`created_at`, `updated_at`, `objid`, `objtype`, `accin`) VALUES('2010-04-26 13:03:09', '2010-04-26 13:03:09', 1, 'promo', 1)

  def activate
    setwspromo
    checkid(params[:id].to_i)
    @promoank = Promoank.find(params[:id])
    if @promoank.active
      @promoank.active =false
    else
      @promoank.active =true
    end
    @promoank.save
---
SELECT * FROM `promoanks` WHERE (`promoanks`.`id` = 1)
UPDATE `promoanks` SET `updated_at` = '2010-04-26 13:05:31', `active` = 1 WHERE `id` = 1

  def show
    setwsadmin
    checkauth
    @rejid=params[:rejectid]
    @ank = Promoank.find(params[:id])
    @anktogroups=Anktogroup.find_all_by_promoank_id(@ank.id)
    @anktolangs=Anktolang.find_all_by_promoank_id(@ank.id)
    @selanks=Selank.find_all_by_promoank_id_and_payed(@ank.id,false)
---
SELECT * FROM `promoanks` WHERE (lname LIKE '%Воробьев%' and id != 1)
SELECT * FROM `anktogroups` WHERE (`anktogroups`.`promoank_id` = 1)
SELECT * FROM `anktolangs` WHERE (`anktolangs`.`promoank_id` = 1)
SELECT * FROM `selanks` WHERE (`selanks`.`promoank_id` = 1 AND `selanks`.`payed` = 0)

  def edit
    setwspromo
    checkid(params[:id].to_i)
    @promoank = Promoank.find(params[:id]) # Promoank.find_by_email(session[:user_id])
---
SELECT * FROM `promoanks` WHERE (`promoanks`.`id` = 1)

  def update
    setwspromo
    checkid(params[:id].to_i)
    @promoank = Promoank.find(params[:id])

    respond_to do |format|
      if @promoank.update_attributes(params[:promoank])
---
SELECT * FROM `promoanks` WHERE (`promoanks`.`id` = 1)
UPDATE `promoanks` SET `educationform_id` = 1, `lname` = 'Воробьев', `updated_at` = '2010-04-26 13:03:44', `workexp` = '', `passwho` = '', `factphone` = '', `facthouse` = '', `passdate` = '2010-04-26', `comment` = '', `passstreet` = '', `clothessize` = '', `institute` = '', `files` = '', `education_id` = 1, `merried` = 0, `pclevel_id` = 1, `passseries` = '', `workcost` = 0.0, `passcity_id` = 1, `nameto` = 'Олегович', `fname` = 'Алексей', `educationstop` = '2010-04-26', `birthday` = '2010-04-26', `workemployment_id` = 1, `medbooknumber` = '', `factmetro_id` = 1, `passnumber` = '', `sex` = 1, `citizenship` = 0, `hasmedbook` = 0, `hairlength_id` = 1, `educationspec` = '', `haircolor_id` = 1, `medbookstop` = '2010-04-26', `factindex` = '', `hascar` = 0, `educationstart` = '2010-04-26', `factstreet` = '', `passhouse` = '', `drivercard` = 0, `workgraphic_id` = 1, `factcity_id` = 1, `pcprogramms` = '', `carmark` = '', `passindex` = '', `mobilephone` = '+7(985)9245136', `skills` = '', `faces` = '', `bootssize` = '' WHERE `id` = 1