app/controllers/register_controller.rb

SELECT * FROM `seccodes` WHERE (`seccodes`.`id` = 51)
SELECT `promoanks`.id FROM `promoanks` WHERE (`promoanks`.`email` = BINARY 'alexey@itima.ru') LIMIT 1
---
  def index
    @sec=Time.now.sec+1
    @min=Time.now.min+1
    @hour=Time.now.hour
    @fval=Seccode.find(:all, :order => "RAND()").first
    @nval=Seccode.find(:all, :order => "RAND()").last
    if @hour<12
    @svar=1
    @str=@fval.name.to_s+" - "+@nval.name.to_s+" =  "
    else
    @svar=2
    @str=@fval.name.to_s+" + "+@nval.name.to_s+" =  "
    end
    @fid=@fval.id
    @nid=@nval.id
    if request.post?
    	# TODO: FIX THIS THING
    if checkkod(params[:val],params[:fid],params[:nid]).to_i==params[:kod].to_i

    	 if params[:what]=='1'

      @ank=Promoank.find_by_email(params[:login].to_s.downcase)